// Напишите программу, которая на вход принимает число и выводит его квадрат
Console.Write("Add number"); //Вывод на терминал приглашение
int number = Convert.ToInt32(Console.ReadLine()); // Чтение целого числа из терминала
int result = number * number;
Console.WriteLine("Square added number:"  + result);
System.Console.WriteLine($"Square added number: {result} write new text");

